CaseLabGreenatom/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкиНДС</name>
  <enumValues>
    <name>БезНДС</name>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
  </enumValues>
</mdclass:Enum>

CaseLabGreenatom/src/CommonModules/НДСКлиент/Module.bsl
#Область ПрограммныйИнтерфейс

&НаКлиенте
Функция СуммаНДСПоСтавке(Сумма, СтавкаНДС) Экспорт //Возвращает сумму НДС из суммы
	
	БезНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
	НДС10 = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10");
	НДС20 = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20");
	
	Если СтавкаНДС = НДС20 Тогда
		
		Множитель = 0.2;
		
		СуммаНДС = Сумма * Множитель;
		
	ИначеЕсли СтавкаНДС = НДС10 Тогда
		
		Множитель = 0.1;
		
		СуммаНДС = Сумма * Множитель;
		
	Иначе 
		
		СуммаНДС = 0;
		
	КонецЕсли;
	
	Возврат СуммаНДС;
	
КонецФункции 

#КонецОбласти
